import pandas as pd
df = pd.read_csv('GooglePlayStore_wild.csv')
print(pd.isnull(df))
# Виведи інформацію про всі DataFrame, щоб дізнатися, які стовпці потребують очищення
print(df.info())    # дізнатись інформацію про дані з файлу
# Скільки в датасеті додатків, у яких не вказано (NaN) рейтинг (Rating)?
print(len(df[pd.isnull(df["Rating"])]))

# Заміни порожнє значення ('NaN') рейтингу ('Rating') для таких програм на -1.
df["Rating"].fillna(-1, inplace = True)  # замінити NaN значення в стовпчику Rating на -1
print(df.info())

# Визнач, яке ще значення розміру ('Size') зберігається в датасеті крім Кілобайтів та Мегабайтів, заміни його на -1.
print(df["Size"].value_counts())

def set_size(size):
    if size[-1] == 'M':          # -1 останній символ
        return float(size[:-1])    # [:-1] від першого до останього символу
    elif size[-1] == "k":
        return float(size[:-1]) / 1024 # / 1024 щоб перевести мегабайти в кілобайти
    else:
        return -1   # повернути -1


def remove_sign(sign):
    if sign[0] == "$":
        return float(sign[1:])

df["Price"] == df["Price"].apply(remove_sign)
print(df["Price"])
        

# Перетвори розміри додатків ('Size') у числовий формат (float). Розмір усіх програм повинен вимірюватися в Мегабайтах.
# Чому дорівнює максимальний розмір ('Size') додатків з категорії ('Category') 'TOOLS'?
df["Size"] = df["Size"].apply(set_size) # застосувати df["Size"] функцію set_size за допомогою apply()
print(df[df["Category"] == "TOOLS"]["Size"].max())


# Бонусні завдання
# Заміни тип даних на цілий (int) для кількості установок ('Installs').
# У записі кількості установок ('Installs') знак "+" необхідно ігнорувати.
# Тобто, якщо в датасеті кількість установок дорівнює 1,000,000+, необхідно змінити значення на 1000000

# Згрупуй дані за категорією ('Category') та цільовою аудиторією ('Content Rating') будь-яким зручним для тебе способом,
# Порахуй середню кількість установок ('Installs') у кожній групі. Результат округлили до десятих.
# В отриманій таблиці знайди клітинку з найбільшим значенням.
# До якої вікової групи та типу додатків відносяться дані з цієї клітинки?

# У якої програми не вказаний тип ('Type')? Який тип там потрібно записати залежно від ціни?

# Виведи інформацію про все DataFrame, щоб переконатися, що очищення пройшло успішно